Revit 2026 API

# DocumentGetSubelement(ElementId, Int32) Method

---

Gets the subelement referenced by a parent id and subelement id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Subelement GetSubelement(
	ElementId id,
	int subId
)
```
```vb
Public Function GetSubelement (
	id As ElementId,
	subId As Integer
) As Subelement
```
```cpp
public:
Subelement^ GetSubelement(
	ElementId^ id,
	int subId
)
```
```fsharp
member GetSubelement :
        id : ElementId *
        subId : int -> Subelement
```

#### Parameters

id ElementId
     Id of the element.
subId Int32
     Id of the sub element.

#### Return Value

Subelement The subelement referenced by the input argument.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

will be returned if the input id string doesn't reference to a valid element or subelement.

#### Reference

Document Class

GetSubelement Overload

Autodesk.Revit.DB Namespace